Revit 2027 API
TableSectionData.GetRowHeight Method
 Returns a row's height in feet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetRowHeight(
	int nRow
)
Public Function GetRowHeight (
	nRow As Integer
) As Double
public:
double GetRowHeight(
	int nRow
)
member GetRowHeight :
        nRow : int -> float
Parameters
nRow Int32
Return Value
Double
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace